#
# shell
#
brew "fish"
brew "stow"
brew "ripgrep"
brew "rga"
# required by rga
brew "poppler"
brew "direnv"
brew "jump"
brew "tmux"
brew "fd"
brew "bat"
brew "fzf"
brew "ncdu"
brew "jq"
brew "yq"
brew "jo"
brew "wget"
brew "htop"
brew "watchman"
brew "dust"

#
# editor
#
tap "d12frosted/emacs-plus"
brew "emacs-plus@29"
brew "hunspell"
brew "gnu-indent"

#
# dev
#
brew "cmake"
brew "nasm"

#
# ops
#
brew "pass"
brew "borgbackup"
brew "terraform"
cask "google-cloud-sdk"
brew "kubectx"
brew "minikube"
brew "nmap"
brew "rclone"
brew "telnet"

tap "turbot/tap"
brew "steampipe"

#
# os
#
brew "qemu"
cask "vagrant"

#
# languages
#
brew "go"
brew "julia"
brew "graphviz"
